Eventr/app/controllers/activity_events_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT  "activity_events".* FROM "activity_events" WHERE "activity_events"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "activity_events" SET "selected" = $1, "updated_at" = $2 WHERE "activity_events"."id" = $3  [["selected", true], ["updated_at", "2019-09-10 19:09:39.002453"], ["id", 5]]
---
def update
    activity_event = ActivityEvent.find(params[:id])
    activity_event.update(selected: params[:selected])