Eventr/app/controllers/events_controller.rb

    def create
        e = Event.create(name: params[:name], event_type:params[:event_type], date:params[:date], budget:params[:budget], num_people:params[:num_people], interests:params[:interests].join(','), user_id:params[:user_id])
        category_num = params[:interests].join('%2C')
        url ="https://www.eventbriteapi.com/v3/events/search/?token=#{Rails.application.credentials.development[:event_brite]}&location.address=DC&categories=#{category_num}&page=2&expand=venue&location.within=30km"
        uri = URI.parse(url)
        response = Net::HTTP.get_response(uri)
        event_data = JSON.parse(response.body)
        # activities from API
        activities = event_data['events'].sample(6)

      new_activities = activities.map{|event|
      e.activities.create(name: event['name']['text'], link: event['url'], image: event['logo']['original']['url'], category: event['category_id'])}
---
INSERT INTO "events" ("event_type", "name", "num_people", "budget", "date", "created_at", "updated_at", "user_id", "interests") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "activities" ("name", "created_at", "updated_at", "link", "category", "image") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"